const ap = new APlayer({
    container: document.getElementById('aplayer'),
    fixed: true,				//吸底模式			
    autoplay: false,            //自动播放
    lrcType: 1,
    audio: [
      {
        name: '失眠飞行',
        artist: '接个吻，开一枪 / 沈以诚 / 薛明媛',
        url: 'http://m10.music.126.net/20190826141007/d4a99e53c1977057c1b72344b5cf0de6/ymusic/075e/0f52/045c/0431c434b788a0a8a90f3658c6c0fd5f.mp3',      //歌曲链接
        cover: 'https://lyxf2000-1259802619.cos.ap-beijing.myqcloud.com/20190826134603.png',	//封面
      	lrc : '[00:00.13] 编曲：接个吻，开一枪\n[00:01.10] 混音：接个吻，开一枪\n[00:02.90] 想要和你低空飞行\n[00:05.70] 和你到处收集氧气\n[00:07.95] 假如迷雾你看不清\n[00:10.74] 不如坠入我的心里\n[00:13.45] 想带你从吵闹到安宁\n[00:15.95] 想带你从多云到转晴\n[00:18.00] 想要为你整理衬衣\n[00:20.70] 为你到处收集诗句\n[00:23.90] 又过了每晚给你热牛奶的时间\n[00:26.70] 床头还写着我们没看完的影片\n[00:29.00] 离开后的时间里你是否还失眠\n\n\n\n[00:31.75]从不熬夜的我也明显黑了眼圈\n[00:34.00] 你送的玩偶依然陪在身边\n[00:39.00] 记忆逐渐浮现从开始到终点 又重演\n[00:43.00] 我想和你 一起闯进森林潜入海底\n[00:48.00] 我想和你 一起看日出到日落天气\n[00:52.95] 我想和你穿过格林威治和时间飞行\n[00:58.00] 我想见你 穿过教堂和人海拥抱你\n[01:02.80] 我想和你\n[01:13.40] 我想和你\n[01:23.90] 想要和你低空飞行\n[01:26.20] 和你到处收集氧气\n[01:28.70] 假如迷雾你看不清\n[01:31.20] 不如坠入我的心里\n[01:34.10] 想带你从吵闹到安宁\n[01:36.85] 想带你从多云到转晴\n[01:38.90] 想要为你整理衬衣\n[01:41.75] 为你到处收集诗句\n[01:44.75] 又过了每晚给你热牛奶的时间\n[01:47.10] 床头还写着我们没看完的影片\n[01:49.90] 离开后的时间里你是否还失眠\n[01:52.60] 从不熬夜的我也明显黑了眼圈\n[01:54.90] 你送的玩偶依然陪在身边\n[01:59.90] 记忆逐渐浮现从开始到终点 又重演\n[02:03.90] 我想和你 一起闯进森林潜入海底\n[02:08.90] 我想和你 一起看日出到日落天气\n[02:13.75] 我想和你穿过格林威治和时间飞行 \n[02:18.96] 我想见你 穿过教堂和人海拥抱你\n[02:23.95] 我想和你\n[02:34.00] 我想和你\n[02:44.30] 我想和你\n[02:46.40] 再路过那家咖啡店\n[02:48.78] 熟悉又陌生的地点\n[02:50.70] 驻足希望你的身影会出现\n[02:56.30] 还没说出口的抱歉\n[02:58.75] 曾和你约定的诺言\n[03:00.80] 抬头闭眼让泪流进心里面\n[03:04.65] 我想和你 一起闯进森林潜入海底\n[03:09.75] 我想和你 一起看日出到日落天气\n[03:14.78] 我想和你穿过格林威治和时间飞行\n[03:19.05] 我想见你 穿过教堂和人海拥抱你\n[03:23.45] 母带工程师：殇小谨 \n[03:23.70] 录音室：tweak tone labs ( Beijing ）\n[03:24.00] 录音师：接个吻，开一枪 / 梁家银\n[03:25.10] 电吉他：接个吻，开一枪\n[03:25.45] 木吉他：接个吻，开一枪'
      },

      {
        name: 'Take Away',
        artist: 'The Chainsmokers / ILLENIUM / Lennon Stella',
        url: 'http://m10.music.126.net/20190826143650/ebdba3fdcc7a058bb23876ce13283324/ymusic/5609/565b/535f/ace2714315a15396bc87d57cc358b6ca.mp3',      //歌曲链接
        cover: 'http://p2.music.126.net/qh6hKKo2upxKnkapZgq5Qw==/109951164237873825.jpg',	//封面
   		
   },

       {
        name: 'What I Never Had',
        artist: 'Zain Conor',
        url: 'http://music.163.com/song/media/outer/url?id=504204190.mp3',      //歌曲链接
        cover: 'http://p2.music.126.net/RhzYh3UlIjgZsI9pUmZeTQ==/109951163019809278.jpg',	//封面
      },
    ]
});


